In [2]:
import pandas as pd
import seaborn as sns
from pydataset import data

In a jupyter notebook, classification_exercises.ipynb, use a python module (pydata or seaborn datasets) containing datasets as a source from the iris data. Create a pandas dataframe, df_iris, from this data.

print the first 3 rows

In [9]:
iris = data('iris')
iris.head(3)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa

print the number of rows and columns (shape)

In [10]:
iris.shape

(150, 5)

print the column names

In [11]:
iris.columns

Index(['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width',
       'Species'],
      dtype='object')

print the data type of each column

In [12]:
iris.dtypes

Sepal.Length    float64
Sepal.Width     float64
Petal.Length    float64
Petal.Width     float64
Species          object
dtype: object

print the summary statistics for each of the numeric variables

In [13]:
iris.describe()

       Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

Read the data from this google sheet into a dataframe, df_google.
https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit?usp=sharing

print the first 3 rows

In [3]:
sheet_url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357'

csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')

df_googlesheet = pd.read_csv(csv_export_url)
df_googlesheet.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

print the number of rows and columns

In [4]:
df_googlesheet.shape

(891, 12)

print the column names

In [5]:
df_googlesheet.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

print the data type of each column

In [6]:
df_googlesheet.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

print the summary statistics for each of the numeric variables

In [7]:
df_googlesheet.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

print the unique values for each of your categorical variables

In [12]:
cat_vars = ['Sex', 'Cabin', 'Embarked']
for col in cat_vars:
    print(df_googlesheet[col].value_counts())

male      577
female    314
Name: Sex, dtype: int64
B96 B98            4
G6                 4
C23 C25 C27        4
F2                 3
C22 C26            3
D                  3
E101               3
F33                3
C93                2
B77                2
B22                2
E44                2
D26                2
B18                2
E67                2
C123               2
B5                 2
E121               2
C68                2
D17                2
F G73              2
E24                2
E25                2
D35                2
C125               2
C124               2
C83                2
C2                 2
C78                2
B57 B59 B63 B66    2
D33                2
C92                2
C52                2
B28                2
B49                2
B51 B53 B55        2
B20                2
F4                 2
B35                2
D36                2
E8                 2
E33                2
C65                2
D20                2
B58 B60            2
C126               2
C104               1
A10                1
D7                 1
C47                1
C91                1
D48                1
C101               1
D30                1
C62 C64            1
C90                1
B37                1
C106               1
A26                1
B41                1
A5                 1
A19                1
B4                 1
C54                1
A24                1
C110               1
F G63              1
A32                1
D49                1
E49                1
D11                1
B82 B84            1
T                  1
D19                1
E50                1
B78                1
E12                1
D50                1
D21                1
C30                1
C95                1
B73                1
C46                1
A23                1
B79                1
C103               1
E38                1
C7                 1
B42                1
D46                1
E63                1
C32                1
C70                1
A36                1
C86                1
B38                1
A20                1
C87                1
A6                 1
A14                1
C45                1
C50                1
B3                 1
F38                1
A16                1
D56                1
C99                1
B102               1
E68                1
D28                1
D15                1
E36                1
D47                1
E31                1
B30                1
C128               1
E34                1
D10 D12            1
D37                1
F E69              1
B19                1
B50                1
B86                1
E10                1
A34                1
C82                1
B71                1
C111               1
E46                1
B101               1
A31                1
E58                1
B80                1
D6                 1
D45                1
B94                1
E40                1
D9                 1
A7                 1
C118               1
E17                1
C49                1
B39                1
C85                1
B69                1
C148               1
E77                1
Name: Cabin, dtype: int64
S    644
C    168
Q     77
Name: Embarked, dtype: int64